# DataFrame-Pandas

In [1]:
#DataFrame-with DataFrame we can create two dimenton table with row and column
import numpy as np
import pandas as pa

In [7]:
#creating DataFrame using List
lst=["Asha",'Versha','baby','Azula']
df=pa.DataFrame(data=lst)#it's automatically generated row and column as 0,1...
df

        0
0    Asha
1  Versha
2    baby
3   Azula

In [8]:
#in DataFrame,if we use print() ,it give output as normal but directly if we print,it's give colorfull output
print(df)

        0
0    Asha
1  Versha
2    baby
3   Azula

In [13]:
#how to set row and column names as we wamt into the DataFrame
lst2=["Asha",'Versha','baby','Azula'],['mani','raju','Raj','Muthu']
print(lst2)
print('*'*50)
df1=pa.DataFrame(lst2,index=['Girls','Boys'],columns=['A','B','C','D'])#index-row heading,columns-Column headings
print(df1)

(['Asha', 'Versha', 'baby', 'Azula'], ['mani', 'raju', 'Raj', 'Muthu'])
**************************************************
          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu

In [15]:
#creating a dictionary containing employee data into dataframe
data={'NAME':['Karthik','Bharat','Vasu','Mani'],
     'AGE':[23,45,56,24],
      'ADDRESS':['TCR','Chennai','Coimbatore','Madurai'],
      'QUALIFICATION':['BSC(CS)','BTEC','MTEC','Bcom']
     }
print(data)
print('*'*50)
df2=pa.DataFrame(data)#it's take dictionary key values as Column heders
df2

{'NAME': ['Karthik', 'Bharat', 'Vasu', 'Mani'], 'AGE': [23, 45, 56, 24], 'ADDRESS': ['TCR', 'Chennai', 'Coimbatore', 'Madurai'], 'QUALIFICATION': ['BSC(CS)', 'BTEC', 'MTEC', 'Bcom']}
**************************************************

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [16]:
print(df2)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [18]:
#how to fetch index(row) values and columns values
print(df2.index)
print(df1.index)
print(df2.columns)

RangeIndex(start=0, stop=4, step=1)
Index(['Girls', 'Boys'], dtype='object')
Index(['NAME', 'AGE', 'ADDRESS', 'QUALIFICATION'], dtype='object')

In [23]:
#selecting a column
print(df2)
print('*'*50)
print(df2['NAME'])#mentioned column datas
print(df2[['NAME']])#mentioned column datas with column header

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
0    Karthik
1     Bharat
2       Vasu
3       Mani
Name: NAME, dtype: object
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [25]:
#selecting a multiple columns
print(df2)
print('*'*50)
print(df2[['NAME','AGE']])#mentioned Name and age column datas and with column headers

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
      NAME  AGE
0  Karthik   23
1   Bharat   45
2     Vasu   56
3     Mani   24
      NAME
0  Karthik
1   Bharat
2     Vasu
3     Mani

In [45]:
#Access the Values from row DataFrame
#iloc-which is used to fetch we given specific row
print(df2)
print('*'*50)
#if i want fetch only Karthik row 
print(df2.iloc[0])
print('*'*50)
#if we want to fetch one value from dataframe,we can use below statment
print(df2['NAME'][0])

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************
NAME             Karthik
AGE                   23
ADDRESS              TCR
QUALIFICATION    BSC(CS)
Name: 0, dtype: object
**************************************************
Karthik

In [48]:
#drop-it is used to delete one 
print(df2)
print('*'*50)
#if we want delete One column,use below code
df2.drop('AGE',axis=1)

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom
**************************************************

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [49]:
#if we want delete One row,use below code
df2.drop(0,axis=0)

     NAME  AGE     ADDRESS QUALIFICATION
1  Bharat   45     Chennai          BTEC
2    Vasu   56  Coimbatore          MTEC
3    Mani   24     Madurai          Bcom

In [50]:
df2#above we did drop changes not applied in real varible if we want to delete permently we can use inplace

      NAME  AGE     ADDRESS QUALIFICATION
0  Karthik   23         TCR       BSC(CS)
1   Bharat   45     Chennai          BTEC
2     Vasu   56  Coimbatore          MTEC
3     Mani   24     Madurai          Bcom

In [51]:
df2.drop('AGE',axis=1,inplace=True)#Age column deleted Permently using inplace keyword

In [52]:
df2

      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom

In [51]:
#create DataFrame with NaN values
import pandas as pa
import numpy as np
nan_dataframe=pa.DataFrame([[10,np.nan,30],[40,50,np.nan],[60,70,80],[np.nan,np.nan,np.nan]])
nan_dataframe

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [56]:
#dropna-which is used to drop row or column which are contain NaN value and display unnan values
print(nan_dataframe.dropna())#defaultly it will deleted row wise
print('*'*50)
print(nan_dataframe.dropna(axis=0))#row
print('*'*50)
print(nan_dataframe.dropna(axis=1))#if we want delete column wise use axis=1
#if we want to permently delete non values in DataFrame ,use inplace=True

      0     1     2
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [72]:
#thresh-it will display non-nan valus rows or columns as we given value
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.dropna(thresh=2))#it's display which are the row has two non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=0))#it's display which are the row has three non-Nan values
print('*'*50)
print(nan_dataframe.dropna(thresh=3,axis=1))#it's display which are the column has three non-Nan values
#use inplace=true to permenant cahnge

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
**************************************************
      0     1     2
2  60.0  70.0  80.0
**************************************************
      0
0  10.0
1  40.0
2  60.0
3   NaN

In [80]:
#fillna-it is used to fill we given value to nan value posotion
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.fillna(value="karthik"))
print('*'*50)
print(nan_dataframe.fillna(value=20))
print('*'*50)
print(nan_dataframe.fillna(value=nan_dataframe.mean()))

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
         0        1        2
0     10.0  karthik     30.0
1     40.0     50.0  karthik
2     60.0     70.0     80.0
3  karthik  karthik  karthik
**************************************************
      0     1     2
0  10.0  20.0  30.0
1  40.0  50.0  20.0
2  60.0  70.0  80.0
3  20.0  20.0  20.0
**************************************************
           0     1     2
0  10.000000  60.0  30.0
1  40.000000  50.0  55.0
2  60.000000  70.0  80.0
3  36.666667  60.0  55.0

In [94]:
#ffill-forward fill-it's fill forward value to the NaN Value
#bfill-backward fill-it is used to fill backward value to the Nan value
print(nan_dataframe)
print('*'*50)
print(nan_dataframe.fillna(method="ffill"))
print(nan_dataframe.fillna(method="bfill"))

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN
**************************************************
      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0  30.0
2  60.0  70.0  80.0
3  60.0  70.0  80.0
      0     1     2
0  10.0  50.0  30.0
1  40.0  50.0  80.0
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [84]:
#concat-it is used to concat two dataFrames or more than two dataframes
print(df1)
print('*'*50)
print(df2)
print('*'*50)
print(pa.concat([df1,df2]))

          A       B     C      D
Girls  Asha  Versha  baby  Azula
Boys   mani    raju   Raj  Muthu
**************************************************
      NAME     ADDRESS QUALIFICATION
0  Karthik         TCR       BSC(CS)
1   Bharat     Chennai          BTEC
2     Vasu  Coimbatore          MTEC
3     Mani     Madurai          Bcom
**************************************************
          A       B     C      D     NAME     ADDRESS QUALIFICATION
Girls  Asha  Versha  baby  Azula      NaN         NaN           NaN
Boys   mani    raju   Raj  Muthu      NaN         NaN           NaN
0       NaN     NaN   NaN    NaN  Karthik         TCR       BSC(CS)
1       NaN     NaN   NaN    NaN   Bharat     Chennai          BTEC
2       NaN     NaN   NaN    NaN     Vasu  Coimbatore          MTEC
3       NaN     NaN   NaN    NaN     Mani     Madurai          Bcom

In [89]:
#crating data frame using concat two series
from pandas import DataFrame,Series
ser1=Series(np.arange(3),index=['A','B','C'])
print(ser1)
print('*'*50)
ser2=Series(np.arange(11,13),index=['X','Y'])
print(ser2)
print('*'*50)
print(pa.concat([ser1,ser2],axis=1,sort=False))#it's concatinated like column it's added first series as first column.second
                                              #series as a second column
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,sort=True))#it's concatinated like a rowise
print('*'*50)
print(pa.concat([ser1,ser2],axis=0,keys=['Tab1','Tab2']))

A    0
B    1
C    2
dtype: int32
**************************************************
X    11
Y    12
dtype: int32
**************************************************
     0     1
A  0.0   NaN
B  1.0   NaN
C  2.0   NaN
X  NaN  11.0
Y  NaN  12.0
**************************************************
A     0
B     1
C     2
X    11
Y    12
dtype: int32
**************************************************
Tab1  A     0
      B     1
      C     2
Tab2  X    11
      Y    12
dtype: int32

In [1]:
#how to change DataFrame into Csv file
import numpy as np
import pandas as pd

In [3]:
data={'Name':['Karthik','Raja','Mani','Muthu'],
     'Age':[23,24,25,26],
     'Role':['Developer','TestEngineer','IAS','IPS'],
     'Degree':['MCA','BSC','Btech','Mtech']}
d=pd.DataFrame(data)
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [5]:
d.to_csv('details.csv')#it's going to save working currently location into c:(C:\Users\Admin\PYTHON\Pandas_Practise_files)
d.to_csv('E:/Python_notes/Details.csv')#here it will store to mentiond E:path as a Csv file

In [8]:
#if we want to save data in to Excel file use below code
d.to_excel('details2.xlsx')#it's going to save working currently location into c:(C:\Users\Admin\PYTHON\Pandas_Practise_files)
d.to_excel('E:/Python_notes/details2.xlsx')#here it will store to mentiond E:path as a excel file

In [12]:
#while saving data's to file,if we not need index means, use below one
d.to_html('details3.html',index=False)#using to_html we can change data's into html file format

In [ ]:
#if we want to save data as a Text file use below code
d.to_csv('details3.txt')

In [18]:
#how to find Who are all have more than age 23
d1=d[d['Age']>23]
d1

    Name  Age          Role Degree
1   Raja   24  TestEngineer    BSC
2   Mani   25           IAS  Btech
3  Muthu   26           IPS  Mtech

In [19]:
#if we want count of who are all have more than 23 means,use below code
d1.count()

Name      3
Age       3
Role      3
Degree    3
dtype: int64

In [20]:
#how to sort whole dataframe by one column or more than one column values
#ascending order
d2=d.sort_values(by='Age')#by is which column we need to sort
d2

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [21]:
#decending order
d2=d.sort_values(by='Age',ascending=False)#by is which column we need to sort,if we give ascending=False,perform decending order
d2

      Name  Age          Role Degree
3    Muthu   26           IPS  Mtech
2     Mani   25           IAS  Btech
1     Raja   24  TestEngineer    BSC
0  Karthik   23     Developer    MCA

In [26]:
#if we want sort whole dataFrame by two columns
d2=d.sort_values(by=['Role','Age'],ascending=False)#but here Age not sorted as we expected cause Role 
d2

      Name  Age          Role Degree
1     Raja   24  TestEngineer    BSC
3    Muthu   26           IPS  Mtech
2     Mani   25           IAS  Btech
0  Karthik   23     Developer    MCA

In [28]:
#if we want to sort one column values insted of whole Dataframe
d3=np.sort(d['Age'])
d3

array([23, 24, 25, 26], dtype=int64)

In [31]:
#how to fetch data who's age more than 25 and completed MCA
data1={'Name':['Karthik','Raja','Mani','Muthu','Raj','Rose'],
     'Age':[27,24,25,26,29,56],
     'Role':['Developer','TestEngineer','IAS','IPS','Engineer','Doctor'],
     'Degree':['MCA','BSC','Btech','Mtech','MCA','MBBS']}
dd=pd.DataFrame(data1)
dd

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [34]:
#how to fetch data who's age more than 25 and completed MCA
dd[(dd['Age']>25) & (dd['Degree']=='MCA')]#here we using & combing two logical conditions instead of 'and'
#if we use |(or) means,both condition will work

      Name  Age       Role Degree
0  Karthik   27  Developer    MCA
4      Raj   29   Engineer    MCA

In [47]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [46]:
#how to find lowest and Higesest value of Specfic column
min1=d['Age'].min()
max1=d['Age'].max()
print(min1)
max1

23

26

In [45]:
#how to find index position of min value
d['Age'].tolist().index(min1)#here it's changing Age column values to list then finding index value of min1=23

0

In [74]:
#how to replace Column value
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [75]:
#how to replace Column value
d['Name'].replace('Mani',"Baby",inplace=True)

In [76]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Baby   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [77]:
#if we want to replace two values from same colum,use below code
d['Name'].replace(['Muthu','Raja'],["Aasha",'Versha'],inplace=True)

In [78]:
d

      Name  Age          Role Degree
0  Karthik   23     Developer    MCA
1   Versha   24  TestEngineer    BSC
2     Baby   25           IAS  Btech
3    Aasha   26           IPS  Mtech

In [ ]:
#with replace also we can use bfill and ffill

In [52]:
#how to find
nan_dataframe

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [53]:
#it's help to drop the row which contain NaN value
nan_dataframe.dropna(axis=0)

      0     1     2
2  60.0  70.0  80.0

In [54]:
#it's help to drop the column which contain NaN value
nan_dataframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [55]:
#it check whether values are Nan or not(Nan means=True,non-nan=False)
nan_dataframe.isnull()
#we can use nan_dataframe.isna() also instaed of isnull()

       0      1      2
0  False   True  False
1  False  False   True
2  False  False  False
3   True   True   True

In [80]:
#it check whether values are Non-NaN or not(not-Nan means=True,nan=False)
nan_dataframe.notna()

       0      1      2
0   True  False   True
1   True   True  False
2   True   True   True
3  False  False  False

In [57]:
#it helps to drop column which has NaN value
#how='any'-if column has any one NaN value,it drop that column
nan_dataframe.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [58]:
#it helps to drop row which has NaN value
#how='any'-if row has any one NaN value,it drop that row
nan_dataframe.dropna(how='any',axis=0)

      0     1     2
2  60.0  70.0  80.0

In [59]:
#it helps to drop row which has NaN value
#how='all'-if row has all NaN value,it drop that row
nan_dataframe.dropna(how='all',axis=0)

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0

In [60]:
#it helps to drop column which has NaN value
#how='all'-if column has all NaN value,it drop that column
nan_dataframe.dropna(how='all',axis=1)

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
2  60.0  70.0  80.0
3   NaN   NaN   NaN

In [92]:
#if we want to fetch anyone  nan values rows,use below code
nan_dataframe[nan_dataframe.isna().any(axis=1)]#it's checking row only
#any()-any one row element is Nan,it will give True

      0     1     2
0  10.0   NaN  30.0
1  40.0  50.0   NaN
3   NaN   NaN   NaN

In [93]:
#if we want to fetch all nan values rows,use below code
nan_dataframe[nan_dataframe.isna().all(axis=1)]#it's checking row only
#all()- all row element is Nan,it will give True

    0   1   2
3 NaN NaN NaN

In [3]:
#pivot()-pandas.pivot(index, columns, values) function produces pivot table based on 3 columns of the DataFrame.
import pandas as pd
new_dataframe=pd.DataFrame({
    'Name':['Karthik','Raja','Mani','Muthu','Raj','Rose'],
     'Age':[27,24,25,26,29,56],
     'Role':['Developer','TestEngineer','IAS','IPS','Engineer','Doctor'],
     'Degree':['MCA','BSC','Btech','Mtech','MCA','MBBS']
})
new_dataframe

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [97]:
#creating pivot table
new_dataframe.pivot(index='Age',columns="Degree",values='Name')#Agecolumn is index,Degreecolumn is Column,name column is Value

Degree   BSC Btech  MBBS      MCA  Mtech
Age
24      Raja   NaN   NaN      NaN    NaN
25       NaN  Mani   NaN      NaN    NaN
26       NaN   NaN   NaN      NaN  Muthu
27       NaN   NaN   NaN  Karthik    NaN
29       NaN   NaN   NaN      Raj    NaN
56       NaN   NaN  Rose      NaN    NaN

In [98]:
#creating pivot table using two column values
new_dataframe.pivot(index='Age',columns="Degree",values=['Name','Role'])

        Name                                      Role                \
Degree   BSC Btech  MBBS      MCA  Mtech           BSC Btech    MBBS
Age
24      Raja   NaN   NaN      NaN    NaN  TestEngineer   NaN     NaN
25       NaN  Mani   NaN      NaN    NaN           NaN   IAS     NaN
26       NaN   NaN   NaN      NaN  Muthu           NaN   NaN     NaN
27       NaN   NaN   NaN  Karthik    NaN           NaN   NaN     NaN
29       NaN   NaN   NaN      Raj    NaN           NaN   NaN     NaN
56       NaN   NaN  Rose      NaN    NaN           NaN   NaN  Doctor


Degree        MCA Mtech
Age
24            NaN   NaN
25            NaN   NaN
26            NaN   IPS
27      Developer   NaN
29       Engineer   NaN
56            NaN   NaN

In [4]:
#between operator-it is used to fetch same data and inbetween  data as we given
new_dataframe

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [6]:
#here if we wnat to fetch Age 24-27 people only means,use between function
new_dataframe[new_dataframe['Age'].between(24,27)]

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech

In [15]:
#if we wnat fetch index row 0-2 means,use below code
new_dataframe.iloc[0:3]

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech

In [17]:
new_dataframe

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [16]:
#value_count()-this method returns every unique value counts of specified column
new_dataframe['Age'].value_counts()

27    1
24    1
25    1
26    1
29    1
56    1
Name: Age, dtype: int64

In [19]:
#if we want to first top 5 ,use below code
new_dataframe['Age'].value_counts().head()

27    1
24    1
25    1
26    1
29    1
Name: Age, dtype: int64

In [18]:
#how to find unique values count for Degree column
new_dataframe['Degree'].value_counts()

MCA      2
BSC      1
Btech    1
Mtech    1
MBBS     1
Name: Degree, dtype: int64

In [20]:
#if we want to least two values means,use below one
new_dataframe['Degree'].value_counts().tail(2)

Mtech    1
MBBS     1
Name: Degree, dtype: int64

In [21]:
new_dataframe

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [23]:
#with uniue function,we can find out unique value presents in specified row
new_dataframe['Degree'].unique()

array(['MCA', 'BSC', 'Btech', 'Mtech', 'MBBS'], dtype=object)

In [24]:
#if we want to find out how many inique value present in the specified column,using nunique()
new_dataframe['Degree'].nunique()#cause mca is repeted two times so it's considered as a one

5

In [25]:
new_dataframe

      Name  Age          Role Degree
0  Karthik   27     Developer    MCA
1     Raja   24  TestEngineer    BSC
2     Mani   25           IAS  Btech
3    Muthu   26           IPS  Mtech
4      Raj   29      Engineer    MCA
5     Rose   56        Doctor   MBBS

In [26]:
#.str.contains()-it is used findout we given string value present in specific column
new_dataframe['Name'].str.contains('Ra',case=False)#case=false-parameter ensures that the search is case-insensitive.

0    False
1     True
2    False
3    False
4     True
5    False
Name: Name, dtype: bool

In [28]:
#if we want count of given string of specific column,use below code
new_dataframe[new_dataframe['Name'].str.contains('Ra',case=False)].shape[0]#shape[0]-it's used to find out no of matching item are present

2

In [36]:
#correlation-The corr() method calculates the relationship between each column in your data set.and it's find correlation only for numeric columnbs
#what kind of relationship corr() function calculating?
'''
linear relationship between two continuous variables(memeory storing order)
'''
#how to check result whether it is good correlation or not?
'''
The values in the correlation matrix range from -1 to 1:
A value close to 1 indicates a strong positive correlation (as one variable increases, the other also tends to increase).
A value close to -1 indicates a strong negative correlation (as one variable increases, the other tends to decrease).
A value close to 0 indicates a weak or no linear correlation between the variables.
'''
numeric_data=pd.DataFrame({1:[1,2,30.0,4,5],2:[6,7.9,8,91,10],3:[151,12,1.3,1.4,15],4:[116,1.7,18,19,2.0]})
numeric_data

      1     2      3      4
0   1.0   6.0  151.0  116.0
1   2.0   7.9   12.0    1.7
2  30.0   8.0    1.3   18.0
3   4.0  91.0    1.4   19.0
4   5.0  10.0   15.0    2.0

In [37]:
#finding correlation of full dataframe
numeric_data.corr()

          1         2         3         4
1  1.000000 -0.196999 -0.389321 -0.243883
2 -0.196999  1.000000 -0.328880 -0.174912
3 -0.389321 -0.328880  1.000000  0.964063
4 -0.243883 -0.174912  0.964063  1.000000

In [39]:
#finding correlation of two columns
numeric_data[[1,2]].corr()

          1         2
1  1.000000 -0.196999
2 -0.196999  1.000000

In [2]:
#astype()-using this function we can change values one datatype to another datatype
import pandas as pd
dd=pd.read_csv("car-sales.csv")
dd

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [3]:
#changing Doors column values to float datadype
#how to find Datatype of dataset column
print(dd['Doors'].dtype)
print('-'*50)
dd1=dd['Doors'].astype(float)
print(dd1)
print('-'*50)
#how to change to string 
dd2=dd['Doors'].astype(str)
print(dd2)

int64
--------------------------------------------------
0    4.0
1    4.0
2    3.0
3    5.0
4    4.0
5    4.0
6    4.0
7    4.0
8    4.0
9    4.0
Name: Doors, dtype: float64
--------------------------------------------------
0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: object

In [4]:
#change Odometer (KM) to float and add to dataset
dd['Odometer (KM)']=dd['Odometer (KM)'].astype(float)

In [5]:
dd

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White       150043.0      4   $4,000.00
1   Honda    Red        87899.0      4   $5,000.00
2  Toyota   Blue        32549.0      3   $7,000.00
3     BMW  Black        11179.0      5  $22,000.00
4  Nissan  White       213095.0      4   $3,500.00
5  Toyota  Green        99213.0      4   $4,500.00
6   Honda   Blue        45698.0      4   $7,500.00
7   Honda   Blue        54738.0      4   $7,000.00
8  Toyota  White        60000.0      4   $6,250.00
9  Nissan  White        31600.0      4   $9,700.00

In [6]:
#how to replace $ symbol from the price column
dd['Price']=dd['Price'].str.replace('[$-,]','',regex=True)#regex-regular expression-if we use regex,it's check matching values
#'[$-,]'=this line of code uses regular expressions to remove any occurrences of '$' and ',' characters from the 'Price' column.

In [7]:
dd['Price']=dd['Price'].astype(float)
dd
print(dd['Price'].dtype)

float64

In [8]:
#cumsum()-cumsum() function to calculate the cumulative sum of a column in a DataFrame.
dd['cumsum']=dd['Price'].cumsum()
dd
#cumulative sum means 
#first take first row value,for second row add first and second row of given column

     Make Colour  Odometer (KM)  Doors    Price   cumsum
0  Toyota  White       150043.0      4   4000.0   4000.0
1   Honda    Red        87899.0      4   5000.0   9000.0
2  Toyota   Blue        32549.0      3   7000.0  16000.0
3     BMW  Black        11179.0      5  22000.0  38000.0
4  Nissan  White       213095.0      4   3500.0  41500.0
5  Toyota  Green        99213.0      4   4500.0  46000.0
6   Honda   Blue        45698.0      4   7500.0  53500.0
7   Honda   Blue        54738.0      4   7000.0  60500.0
8  Toyota  White        60000.0      4   6250.0  66750.0
9  Nissan  White        31600.0      4   9700.0  76450.0

In [9]:
#how to find length of dataset using len() function
l=len(dd)
l

10

In [10]:
#add a column called 'Sale Date' which lists a series of successive dates starting from today (your today)
#finding today date
import datetime
today=datetime.date.today()
#finding length of dataset rows
lenn=len(dd)
#geneare date from today to end of dataset 
da=pd.date_range(start=today,periods=lenn)#periods=length
#date_range() function display dates till we given
dd['Sale Date']=da
dd

     Make Colour  Odometer (KM)  Doors    Price   cumsum  Sale Date
0  Toyota  White       150043.0      4   4000.0   4000.0 2023-09-09
1   Honda    Red        87899.0      4   5000.0   9000.0 2023-09-10
2  Toyota   Blue        32549.0      3   7000.0  16000.0 2023-09-11
3     BMW  Black        11179.0      5  22000.0  38000.0 2023-09-12
4  Nissan  White       213095.0      4   3500.0  41500.0 2023-09-13
5  Toyota  Green        99213.0      4   4500.0  46000.0 2023-09-14
6   Honda   Blue        45698.0      4   7500.0  53500.0 2023-09-15
7   Honda   Blue        54738.0      4   7000.0  60500.0 2023-09-16
8  Toyota  White        60000.0      4   6250.0  66750.0 2023-09-17
9  Nissan  White        31600.0      4   9700.0  76450.0 2023-09-18

In [27]:
#crosstab()
'''
The pd.crosstab() function in pandas is used for computing a cross-tabulation table (also known as a contingency table) of two or more factors. 
It is a useful tool for analyzing and summarizing the relationships between different categorical variables in a dataset.
The resulting table shows the frequency count of various combinations of these categorical variables.
'''
pd.crosstab(dd['Make'],dd['Colour'])
#here we can see how much Black bmw is there,how much white bmw is there ....

Colour  Black  Blue  Green  Red  White
Make
BMW         1     0      0    0      0
Honda       0     2      0    1      0
Nissan      0     0      0    0      2
Toyota      0     1      1    0      2

In [32]:
#how to shuffle dataframe rows
#using sample function we can suffle 
d1=dd.sample(frac=1)#fraction=1 for rows,frac=0 we can't set here
#every run it's change as random module

In [33]:
d1

     Make Colour  Odometer (KM)  Doors    Price   cumsum  Sale Date
2  Toyota   Blue        32549.0      3   7000.0  16000.0 2023-09-11
8  Toyota  White        60000.0      4   6250.0  66750.0 2023-09-17
0  Toyota  White       150043.0      4   4000.0   4000.0 2023-09-09
1   Honda    Red        87899.0      4   5000.0   9000.0 2023-09-10
6   Honda   Blue        45698.0      4   7500.0  53500.0 2023-09-15
7   Honda   Blue        54738.0      4   7000.0  60500.0 2023-09-16
9  Nissan  White        31600.0      4   9700.0  76450.0 2023-09-18
3     BMW  Black        11179.0      5  22000.0  38000.0 2023-09-12
5  Toyota  Green        99213.0      4   4500.0  46000.0 2023-09-14
4  Nissan  White       213095.0      4   3500.0  41500.0 2023-09-13

In [34]:
#how to reset indexes orderwise
d1.reset_index(drop=True,inplace=True)

In [35]:
d1

     Make Colour  Odometer (KM)  Doors    Price   cumsum  Sale Date
0  Toyota   Blue        32549.0      3   7000.0  16000.0 2023-09-11
1  Toyota  White        60000.0      4   6250.0  66750.0 2023-09-17
2  Toyota  White       150043.0      4   4000.0   4000.0 2023-09-09
3   Honda    Red        87899.0      4   5000.0   9000.0 2023-09-10
4   Honda   Blue        45698.0      4   7500.0  53500.0 2023-09-15
5   Honda   Blue        54738.0      4   7000.0  60500.0 2023-09-16
6  Nissan  White        31600.0      4   9700.0  76450.0 2023-09-18
7     BMW  Black        11179.0      5  22000.0  38000.0 2023-09-12
8  Toyota  Green        99213.0      4   4500.0  46000.0 2023-09-14
9  Nissan  White       213095.0      4   3500.0  41500.0 2023-09-13

In [36]:
#how to change one column name as we need
dd

     Make Colour  Odometer (KM)  Doors    Price   cumsum  Sale Date
0  Toyota  White       150043.0      4   4000.0   4000.0 2023-09-09
1   Honda    Red        87899.0      4   5000.0   9000.0 2023-09-10
2  Toyota   Blue        32549.0      3   7000.0  16000.0 2023-09-11
3     BMW  Black        11179.0      5  22000.0  38000.0 2023-09-12
4  Nissan  White       213095.0      4   3500.0  41500.0 2023-09-13
5  Toyota  Green        99213.0      4   4500.0  46000.0 2023-09-14
6   Honda   Blue        45698.0      4   7500.0  53500.0 2023-09-15
7   Honda   Blue        54738.0      4   7000.0  60500.0 2023-09-16
8  Toyota  White        60000.0      4   6250.0  66750.0 2023-09-17
9  Nissan  White        31600.0      4   9700.0  76450.0 2023-09-18

In [40]:
dd.rename(columns={'Odometer (KM)':'Odometer (Miles)'})

     Make Colour  Odometer (Miles)  Doors    Price   cumsum  Sale Date
0  Toyota  White          150043.0      4   4000.0   4000.0 2023-09-09
1   Honda    Red           87899.0      4   5000.0   9000.0 2023-09-10
2  Toyota   Blue           32549.0      3   7000.0  16000.0 2023-09-11
3     BMW  Black           11179.0      5  22000.0  38000.0 2023-09-12
4  Nissan  White          213095.0      4   3500.0  41500.0 2023-09-13
5  Toyota  Green           99213.0      4   4500.0  46000.0 2023-09-14
6   Honda   Blue           45698.0      4   7500.0  53500.0 2023-09-15
7   Honda   Blue           54738.0      4   7000.0  60500.0 2023-09-16
8  Toyota  White           60000.0      4   6250.0  66750.0 2023-09-17
9  Nissan  White           31600.0      4   9700.0  76450.0 2023-09-18